WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.5/Src/main.c
  MX_SPI1_Init();
  MX_SPI2_Init();
//  MX_ADC1_Init();

//  MX_USB_OTG_FS_HCD_Init();

  /* Initialize interrupts */
 // MX_NVIC_Init();                  .............................................
  /* USER CODE BEGIN 2 */
	
//  MX_GPIO_Init();
 
  MX_USART3_UART_Init();
  MX_UART4_Init();
	  MX_NVIC_Init();
	 user_usartInit();   //开串口中断
//	 
//	/*************init the BMP280****************/
//  if (BMP280_Begin() == -1)
//  bmp_data.err_cnt++;
//	printf("Finshed the inition of BMP280.  \r\n");
//	
//	/*************init the MPU9250****************/
 	Init_MPU9250();
  //  Init_MPU6050();
	 // printf("Finshed the inition of MPU9250.  \r\n");
//	
//	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_10,GPIO_PIN_SET);//TURN ON LED_RED 
//	
//	/*************init the EC20****************/	
//  //EC20初始化 ,先拉高在拉低
    EC20_Init();
		
	  MPU9250_Init();             			//初始化MPU9250
			while(mpu_dmp_init())         
    {   
        printff(USART3, "error!!!\r\n",strlen("error!!!\r\n"));
    }
		 printff(USART3, "MPU9250 OK\r\n",strlen("MPU9250 OK\r\n"));
//	printf("Finished the inition of EC20\r\n");
//	
//	printf("Inition Finished\r\n");

	/********init the RTC*******************/
	#if 0
	RTC_HandleTypeDef RtcHandle;
	RTC_TimeTypeDef stimestructureget;
	__HAL_RTC_RESET_HANDLE_STATE(&RtcHandle);
  RtcHandle.Instance = RTC;
  RtcHandle.Init.HourFormat     = RTC_HOURFORMAT_12;
  RtcHandle.Init.AsynchPrediv   = RTC_ASYNCH_PREDIV;
  RtcHandle.Init.SynchPrediv    = RTC_SYNCH_PREDIV;
  RtcHandle.Init.OutPut         = RTC_OUTPUT_DISABLE;
  RtcHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  RtcHandle.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;
	#endif
	
	/*********SEND THE DATA TO GROUND AND SET THE FLAG********/
	#if 0
	
	/*要求所需的矫正*/
	tcp_connect_sever("101.207.17.199","1113");
	uint8_t Test_senddata[11]={'H' ,'E' , 'L' , 'L' , 'O',  'I',  'T',  'I',  'S' , 'M' , 'E' , '!'};
	uint8_t Test_receivedata_example[11]={'!' ,'E'  , 'M'  ,'S' , 'I' , 'T' , 'I' , 'O'  ,'L'  ,'L' , 'E' , 'H' };
	uint8_t Test_receivedata[11]=(0);
	#endif
	
//	//HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&ADC_Value, 100); //send ADC_data to ADC_value
//	     
//	printf("\r\n\r\n\r\n");
//     
//  /*启动GPS接收*/
//	EC20_uart4_send((uint8_t*)UART4_Tx_GPS_TEST1);    // 发送AT+QGPS=1
//	HAL_Delay(500);
//	/*打印AT错误信息*/
//	EC20_uart4_send((uint8_t*)UART4_Tx_TEST7);

//	/*开启IDLE中断*/
//	__HAL_UART_ENABLE_IT(&huart4, UART_IT_IDLE);
//	/*启动DMA接收*/
////  HAL_UART_Receive_DMA(&huart4,ReceiveBuff,BUFFERSIZE); 
//	//		printf("333333 \r\n");
//	
//	bmp_data.v_actual_press_float = BMP280_ReadPressure();    //读取初始气压高度
//		altitude1 = (1013.25-(bmp_data.v_actual_press_float/100))*9;
//		


 // 	Get_IMEI();
	 USART_CLR_RecvBuf();
	 printff(USART3, "Program is running! \r\n",strlen("Program is running! \r\n"));
   // EC20_AT_ATI();
 //  printff(UART4, "ATI\r\n",strlen("ATI\r\n"));
	//   Delay(500);
	//   printff(USART3,ReceiveBuff,sizeof(ReceiveBuff)/sizeof(ReceiveBuff[0]));
	 //   USART_CLR_RecvBuf();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
//		HAL_GPIO_TogglePin(GPIOB,GPIO_PIN_2);

#if 0
#if 1
		//MP9250
		printf("-------------------------------\r\n");
		printf("MPU-9520 \r\n");
		READ_MPU9250_MAG();    //读取磁力计
		READ_MPU9250_ACCEL();  //读取加速度
		READ_MPU9250_GYRO();   //读取陀螺仪

		printf("Mag: x:%d \ty:%d\tz:%d    \r\n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);        //磁力计
		printf("Gyro: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);     // 陀螺仪
		printf("Accel: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);   //加速度
		printf("-------------------------------\r\n\r\n\r\n");
#endif 
		//Bmp280
		bmp_data.v_actual_temp_float = BMP280_ReadTemperature();
		bmp_data.actual_press_u64 = BMP280_ReadPressure_int64();
		bmp_data.v_actual_press_float = BMP280_ReadPressure();

		printf("-------------------------------\r\n");
	
		printf("BMP280 \r\n");
		printf("  T32: %u ℃  \r\n", bmp_data.v_actual_temp_s32);   //直接读的温度值32位
		printf("  P32: %u Pa  \r\n", bmp_data.v_actual_press_u32);   //直接读的气压值32位
		printf("  P64: %.3f KPa \r\n", ((float)bmp_data.actual_press_u64 / 256.0f)/1000);   //将气压转换为64位
   	printf("  Tf: %.3f ℃\r\n", bmp_data.v_actual_temp_float);    //将温度转换为浮点型
		printf("  Pf: %.3f KPa  \r\n", bmp_data.v_actual_press_float/1000);   //将气压转换为浮点型

		float altitude2,altitude ,seaLevelhPa, mmHg;
		mmHg = bmp_data.v_actual_press_float / 133.321995f;   // 同为压强
		printf("  %.2f mmHg \r\n", mmHg);         

		seaLevelhPa = 101325.0f;     //标准大气压
	  altitude2 = (1013.25-((bmp_data.v_actual_press_float)/100))*9;   //测试点海拔高度
	  altitude = altitude2-altitude1;     //相对高度
	  //altitude = 44330 * (1.0 - pow((double)(bmp_data.v_actual_press_float / seaLevelhPa), 0.19029)); //pow函数？
		printf( "  %.2f m  \r\n", altitude);   //高度
   

		printf("  nerror: %u \r\n", bmp_data.err_cnt);
  	printf("-------------------------------\r\n\r\n");  
		
#endif
#if 0

	  printf("---------------------\r\n");
		printf("数据转换为字符串并发送\r\n");
		
		sprintf((char*)Atempdata1,"Mag: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);
		sprintf((char*)Atempdata2,"Gyro: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);
		sprintf((char*)Atempdata3,"Accel: x:%d \ty:%d\tz:%d  \r\n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);
		
		
		sprintf((char*)tempdata1,"T32: %u 'C  \r\n", bmp_data.v_actual_temp_s32);
		sprintf((char*)tempdata2,"P32: %u Pa  \r\n", bmp_data.v_actual_press_u32);
		sprintf((char*)tempdata3,"P64: %.3f Pa \r\n", (float)bmp_data.actual_press_u64 / 256.0f);
		sprintf((char*)tempdata4,"Tf: %.3f  'C \r\n", bmp_data.v_actual_temp_float);
		sprintf((char*)tempdata5,"Pf: %.3f Pa  \r\n", bmp_data.v_actual_press_float);
		
		sprintf((char*)tempdata6,"%.2f mmHg \r\n", mmHg);
		sprintf((char*)tempdata7,"%.2f m  \r\n", altitude);

		//数据转换为字符串并发送
		EC20_Transmit_Printf((uint8_t*)Atempdata1);
		EC20_Transmit_Printf((uint8_t*)Atempdata2);
		EC20_Transmit_Printf((uint8_t*)Atempdata3);
		
		EC20_Transmit_Printf((uint8_t*)tempdata1);
		EC20_Transmit_Printf((uint8_t*)tempdata2);
		EC20_Transmit_Printf((uint8_t*)tempdata3);
		EC20_Transmit_Printf((uint8_t*)tempdata4);
		EC20_Transmit_Printf((uint8_t*)tempdata5);
		EC20_Transmit_Printf((uint8_t*)tempdata6);
		EC20_Transmit_Printf((uint8_t*)tempdata7);
		printf("END\r\n");
		printf("---------------------\r\n\r\n");
	#endif	

#if 0 //GPRS test
	
		/*数据连接中断一次不可再连接，需重新启动或者关闭网络20秒左右后方能连接*/
		if(test_counter_polling==20)
		{
		  EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST1);
			test_counter_polling=0;
		}
		test_counter_polling++;
		


			
