WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.5/Src/main.c
		#if 0
		/*询问GPS定位信息*/
		
		printf("444444\r\n");
		EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST2);
		
		/*接受串口数据*/		
	  EC20_Receive();
	 
		
		
		/*开启直传模式*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST1);
	  EC20_Receive();
		
    /*开启传送开关*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST2);
	  EC20_Receive();
		
		
		/*传送TCP数据*/
			printf("5555555\n");
		/*（1）传送GPS数据*/
	  EC20_Transmit((uint8_t*)GPS_DATA_RECEIVE);
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		/*（2）传送传感器数据*/
		
		/*传送BMP9250数据*/
		EC20_Transmit((uint8_t*)Atempdata1);
		EC20_Transmit((uint8_t*)Atempdata2);
		EC20_Transmit((uint8_t*)Atempdata3);
		
		/*传送BMP280数据*/
		EC20_Transmit((uint8_t*)tempdata1);
		EC20_Transmit((uint8_t*)tempdata2);
		EC20_Transmit((uint8_t*)tempdata3);
		EC20_Transmit((uint8_t*)tempdata4);
		EC20_Transmit((uint8_t*)tempdata5);
		EC20_Transmit((uint8_t*)tempdata6);
		EC20_Transmit((uint8_t*)tempdata7);
		
		printf("666666\n");
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		
		/*打印并清除数据*/
		printf("\r\n数据如下：\r\n");
		 for(int i = 0; i < COUNTOF(GPS_DATA_RECEIVE); i++) 
    {
			printf("%c",ReceiveBuff[i]);
			GPS_DATA_RECEIVE[i]=0;
		}
		
		/*初始化检测*/
    test_flag=HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_15);
		
    /*如果检测STATE口为低，重新检测并初始化*/
		if(test_flag==1)
		{
			
      EC20_Init();
			test_count++;
			if(test_count==10)
			{
				printf("EC20断电失败\n");
				test_count=0;
				break;
			}
	  }
		#endif
#endif
				

#if 0 //adc采样，采样电池
				HAL_Delay(500);
        for(ADC_i = 0,ad1 =0; ADC_i< 100;)
        {
            ad1 += ADC_Value[ADC_i++];

        }
        ad1 /= 50;
        printf("\r\n******** ADC DMA Example ********\r\n\r\n");
        printf(" AD1 value = %1.3fV \r\n", ad1*3.3f/4096);


#endif


#if 0 //ec20数据整合
		
			/**********Send the data to the Ground and check it****************/
//			if(HAL_UART_Transmit_IT(&huart4, (uint8_t *)Test_senddata, sizeof(Test_senddata)) != HAL_OK)
//			{
//					Error_Handler();
//			}
//			Delay(100);
//		
//			if(HAL_UART_Receive_IT(&huart4, (uint8_t *)Test_receivedata, sizeof(Test_receivedata)) != HAL_OK)
//			{
//				Error_Handler();
//			}
//			
//		for(uint8_t comparecount=0,Different_flag=0;comparecount<=sizeof(Test_receivedata);comparecount++)//??辫?箨?????陏?Y
//		{	
//			/*****************COMPARE the flag of the data which form Ground*********************/
//			if(Test_receivedata[comparecount]==Test_receivedata_example[comparecount])
//			{
//				Different_flag++;
//				printf(" Connect %u  \n", Different_flag);
//			}
//			/***************If receive the data from Ground,begain send the data*************/
//			if(Different_flag==sizeof(Test_senddata))
//			{
//				Flag_run=SUCCFULL_STA;//enable the data of GPRS
//			}
//		}
	
		if(1)
		{
		tcp_connect_sever("101.207.17.199","1113");
		HAL_RTC_GetTime(&RtcHandle, &stimestructureget, RTC_FORMAT_BIN);//Get the time of RTC
		
		/***********Set the communication protocol on GPRS.***************/
		/*结构体赋值*/
		Uavcomunication.Longitude=mpu_value.Mag[0];
		Uavcomunication.Lantitude=mpu_value.Mag[1];
		Uavcomunication.Altitude=altitude;
		Uavcomunication.Speed_x=mpu_value.Accel[0];
		Uavcomunication.Speed_y=mpu_value.Accel[1];
		Uavcomunication.Speed_z=mpu_value.Accel[2];
		Uavcomunication.Roll_angle=mpu_value.Gyro[0];
		Uavcomunication.Pitch_angle=mpu_value.Gyro[1];
		Uavcomunication.Yaw_angle=mpu_value.Gyro[2];
		Uavcomunication.Timestamp=stimestructureget.Seconds;
		Uavcomunication.Battery_status=0;
		Uavcomunication.Uav_type=0;
		Uavcomunication.Vendor="HW";
		Uavcomunication.System_status=0;
		
		/*********ACCORDING TO STATE INIT THE Uavcomunication.System_status*************/
		if(bmp_data.err_cnt==0)
		{Uavcomunication.System_status=Uavcomunication.System_status&SENSORS_STATE_OK;}
		
		if(Flag_run==1)
		{Uavcomunication.System_status=Uavcomunication.System_status&CONNECT_STATE_OK;}
		
		/* To transmit the Uav of date */
		/*传送数据*/
		EC20_Transmit((uint8_t*)Uavcomunication);
		/*开启直传模式*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST1);
	  EC20_Receive();
		
    /*开启传送开关*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST2);
	  EC20_Receive();
		
		
		/*传送TCP数据*/
		
		/*传送UAV数据*/
	  EC20_Transmit((uint8_t*)Uavcomunication);
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		}
		
#if 0//message test
		
		/*设置短信存储区*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE1);
	  EC20_Receive();

		/*设置短信存储区格式*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE2);
		EC20_Receive();
			
		/*查询短信中心*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE3);
	  EC20_Receive();

		/*设置短信文本格式*/
		EC20_Transmit((uint8_t*)UART4_Tx_MESSAGE4);
		EC20_Receive();
		
		/*发送短信，手机号码确定，结束标志位0X1A*/
		EC20_Transmit((uint8_t*)UART4_Tx_TEST6);
		EC20_Receive();
		
		/*发送字符串内容，字符串内容自定义*/
		EC20_Transmit((uint8_t*)GPS_DATA_RECEIVE);
	
    /*发送结束符，结束后需等待5秒收到短信*/
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);
	
#endif
#endif
#if 0
 printff(UART4, "ATI\r\n",strlen("ATI\r\n"));
 printff(USART3, "ATI\r\n",strlen("ATI\r\n"));
 LL_mDelay(3000);
 printff(USART3,UART4_ReceiveBuff,strlen(UART4_ReceiveBuff));
 USART_CLR_RecvBuf();
#endif
#if 0 


	     readdmp();
		   getquaternion();//四元素
		   getgyro();//陀螺仪
		   getaccel();//加速度计
		   getyawpitchroll();//根据四元素算出欧拉角
			 sprintf(DATA, "%g", yprf[0]);
			 printff(USART3, DATA, 10);
			 	printff(USART3, "\r\n", strlen("\r\n"));
			  sprintf(DATA1, "%g", yprf[1]);
			 printff(USART3, DATA1, 10);
			 	printff(USART3, "\r\n", strlen("\r\n"));
			  sprintf(DATA2, "%g", yprf[2]);
			 printff(USART3, DATA2, 10);
			 	printff(USART3, "\r\n", strlen("\r\n"));
		   OutData[0] = yprf[0];//欧拉角
		   OutData[1] =gyrof[0]; //陀螺仪
		   OutData[2] =  accelf[1]/200;//加速度计
		   OutData[3] =  2000;  //用来检测输出是否正常
		   OutPut_Data();
			printff(USART3, "\r\n", strlen("\r\n"));
		  	printff(USART3, data, 10);
					printff(USART3, "\r\n", strlen("\r\n"));
			 LL_mDelay(300);
#endif

     if(mpu_mpl_get_data(&pitch,&roll,&yaw)==0)
     {
        temp=MPU_Get_Temperature();	//得到温度值
			  MPU_Get_Accelerometer(&aacx,&aacy,&aacz);	//得到加速度传感器数据
			  MPU_Get_Gyroscope(&gyrox,&gyroy,&gyroz);	//得到陀螺仪数据
  		//	if(report)mpu9250_send_data(aacx,aacy,aacz,gyrox,gyroy,gyroz);//发送加速度+陀螺仪原始数据
		//	if(report)usart1_report_imu((int)(roll*100),(int)(pitch*100),(int)(yaw*100),0,0);
			if((t%10)==0)
			{ 
				if(temp<0)
				{
					LCD_ShowChar(30+48,200,'-',16,0);		//显示负号
					temp=-temp;		//转为正数
				}else LCD_ShowChar(30+48,200,' ',16,0);		//去掉负号 
				LCD_ShowNum(30+48+8,200,temp/100,3,16);		//显示整数部分	    
				LCD_ShowNum(30+48+40,200,temp%10,1,16);		//显示小数部分 
				temp=pitch*10;
				if(temp<0)
				{
					LCD_ShowChar(30+48,220,'-',16,0);		//显示负号
					temp=-temp;		//转为正数
				}else LCD_ShowChar(30+48,220,' ',16,0);		//去掉负号 
				LCD_ShowNum(30+48+8,220,temp/10,3,16);		//显示整数部分	    
				LCD_ShowNum(30+48+40,220,temp%10,1,16);		//显示小数部分 
				temp=roll*10;
				if(temp<0)
				{
					LCD_ShowChar(30+48,240,'-',16,0);		//显示负号
					temp=-temp;		//转为正数
				}else LCD_ShowChar(30+48,240,' ',16,0);		//去掉负号 
				LCD_ShowNum(30+48+8,240,temp/10,3,16);		//显示整数部分	    
				LCD_ShowNum(30+48+40,240,temp%10,1,16);		//显示小数部分 
				temp=yaw*10;
				if(temp<0)
				{
					LCD_ShowChar(30+48,260,'-',16,0);		//显示负号
					temp=-temp;		//转为正数
				}else LCD_ShowChar(30+48,260,' ',16,0);		//去掉负号 
				LCD_ShowNum(30+48+8,260,temp/10,3,16);		//显示整数部分	    
				LCD_ShowNum(30+48+40,260,temp%10,1,16);		//显示小数部分  
				t=0;
			//	LED0_Toggle;//DS0闪烁 
			}
			t++;
		}
  }
	
  /* USER CODE END 3 */

